{"class_name": "Functional", "config": {"name": "model_32", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "Inputs"}, "name": "Inputs", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_102", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "keras_layer_102", "inbound_nodes": [[["Inputs", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_103", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/4"}, "name": "keras_layer_103", "inbound_nodes": [{"input_type_ids": ["keras_layer_102", 0, 1, {}], "input_mask": ["keras_layer_102", 0, 0, {}], "input_word_ids": ["keras_layer_102", 0, 2, {}]}]}, {"class_name": "Dropout", "config": {"name": "Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Dropout", "inbound_nodes": [[["keras_layer_103", 0, 13, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense", "inbound_nodes": [[["Dropout", 0, 0, {}]]]}], "input_layers": [["Inputs", 0, 0]], "output_layers": [["Dense", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}